BEGIN TRANSACTION;
DROP TABLE IF EXISTS `goods`;
CREATE TABLE IF NOT EXISTS `goods` (
	`id`	INTEGER NOT NULL PRIMARY KEY AUTOINCREMENT UNIQUE,
	`category_id`	INTEGER NOT NULL,
	`name`	TEXT NOT NULL,
	`quantity`	INTEGER NOT NULL,
	`quantity_unit`	TEXT NOT NULL,
	`term`	INTEGER NOT NULL,
	`start_date`	INTEGER NOT NULL,
	`end_date`	INTEGER NOT NULL
);
DROP TABLE IF EXISTS `categories`;
CREATE TABLE IF NOT EXISTS `categories` (
	`id`	INTEGER NOT NULL PRIMARY KEY AUTOINCREMENT UNIQUE,
	`name`	TEXT NOT NULL UNIQUE
);
INSERT INTO "categories" ("id","name") VALUES (28,'рідкі суміші'),
 (29,'насипні'),
 (30,'палети'),
 (31,'шини та диски'),
 (32,'документи'),
 (33,'зброя і вибухівка'),
 (34,'малогабаритні вантажі'),
 (35,'великогабаритні вантажі');
INSERT INTO "goods" ("id","category_id","name","quantity","quantity_unit","term","start_date","end_date") VALUES (17,28,'молоко',15,'бідон',3,'2022-05-01','2022-05-04'),
 (18,28,'вода',3,'тона',14,'2022-05-02','2022-05-16'),
 (19,35,'холодильник',2,'штука',29,'2022-05-01','2022-05-30'),
 (21,32,'книжки',3,'штука',21,'2022-05-03','2022-05-24'),
 (22,32,'мапа донецької області',7,'штука',6,'2022-05-04','2022-05-10'),
 (23,33,'птрк стугна-п',4,'штука',14,'2022-05-05','2022-05-19'),
 (24,33,'рпг-7',10,'штука',5,'2022-05-06','2022-05-11'),
 (25,34,'планшет lenovo tab',1,'штука',30,'2022-05-01','2022-05-31'),
 (26,34,'мультиварка',1,'штука',55,'2022-05-07','2022-07-01'),
 (27,29,'зерно пшениці',5,'тонна',90,'2022-05-08','2022-08-06'),
 (28,29,'пісок',3,'тонна',65,'2022-05-09','2022-07-13'),
 (29,30,'морозиво',1,'палета',21,'2022-05-10','2022-05-31'),
 (30,30,'пінопласт',2,'палета',5,'2022-05-11','2022-05-16'),
 (31,31,'шини від камаз-4310',4,'штука',14,'2022-05-12','2022-05-26'),
 (32,31,'шини від уаз-452',2,'штука',124,'2022-05-13','2022-09-14'),
 (36,35,'автомобіль',1,'штука',10,'2022-05-20','2022-05-30');
COMMIT;
